Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Federn, nicht aus Metall, als Teile von Polsterwaren
en: Springs being non-metallic fittings for upholstery

source: Dekorative Actionfiguren aus Holz
en: Action figures (Decorative -) of wood

source: Verkaufsgondeln [nicht aus Metall]
en: Sales gondolas (Non-metallic -)

source: Kugelschnäpper [nicht aus Metall]
en: Ball catches [not of metal]

source: Regalböden aus Holz [Möbel]
en: Wooden shelving [furniture]

source: Arbeitsflächen in Form von Möbeln
en: Work surfaces in the nature of furniture

source: Einbauschränke
en: Wall cupboards

source: Fußschemel zur Wandmontage
en: Wall mounted footstools

source: Angepasste Schutzhüllen aus Kunststoff für Möbel
en: Protective coverings for furniture [shaped]

source: Kisten
en: Chests

source: Hohlraumdübel, nicht aus Metall
en: Cavity plugs (Non-metallic -)

source: Spezialbetten für Personen mit eingeschränkter Bewegungsfähigkeit
en: Beds adapted for use by those with mobility difficulties

source: Modulare Schreibtische [Möbel]
en: Modular desks [furniture]

source: Multipositions-Ausstellungsständer aus Aluminium- und Stahlrohr
en: Multiposition display stands made from aluminium and steel tubing

source: Eckenschutzleisten, nicht aus Metall, für Möbel
en: Corner beads (Non-metallic -) for furniture

source: Kantenschützer aus Kunststoff
en: Corner protectors of plastics

source: Kissen [Polster]
en: Cushions (upholstery)

source: Luftkissen als Möbel [nicht für medizinische Zwecke]
en: Air cushions in the nature of furniture [not for medical purposes]

source: Gewindestäbe, nicht aus Metall
en: Screwed rods, not of metal

source: Diwane aus Schilf
en: Divans made of reed

source: Eierschachteln aus Kunststoff
en: Egg trays made of plastics

source: Figurinen aus Gipsderivaten
en: Figurines made of gypsum derivatives

source: Rahmenlose Bilderhalter
en: Frameless picture holders

source: Tragekisten, nicht aus Metall
en: Carrying boxes (Non-metallic -)

source: Kisten [ nicht aus Metall] für Flaschen
en: Cases (Non-metallic -) for bottles

source: Schatullen aus Kork
en: Caskets made of cork

source: Nicht metallische Bohrschrauben
en: Self-tapping non-metallic bolts

source: Nadelventile, nicht aus Metall, für Behälter
en: Spears [valves], not of metal for use with containers

source: Truhen [Möbel]
en: Furniture chests

source: Clubsessel für kosmetische Behandlungen
en: Lounge chairs for cosmetic treatments

source: Schaugestelle für Kostüme
en: Costume display stands

source: Schränke für Abfallbehälter
en: Cabinets for waste bins

source: Lichtdichte Innenrollos
en: Blackout blinds [indoor]

source: Möbel zum Ausstellen von Schreibwaren
en: Units [furniture] for the display of stationery

source: Schminkspiegel für den Haushalt
en: Make-up mirrors for the home

source: Anschlagtafeln zum Beschreiben
en: Marker boards for display purposes

source: Holzstiele für Lollis oder Eiscreme
en: Wooden sticks for holding candy or ice cream

source: Außenlattenrollos aus Holz
en: Sun screens [slatted outdoor]

source: Haltestangen für Vorhänge
en: Support rods for curtains

source: Treppenleisten aus Kunststoff
en: Stair edgings of plastics

source: Sitzkissen [Möbel]
en: Pouffes [furniture]

source: Vorgefertigte Möbeltüren aus Metall
en: Prefabricated doors of metal for furniture

source: Vorgefertigte Regale [Möbel]
en: Prefabricated shelves [furniture]

source: Dekorative Holzpaneele [Möbel]
en: Decorative wooden panels [furniture]

source: Innenrollos aus Polyvinylchlorid
en: Polyvinyl chloride blinds [indoor]

source: Türklopfer, nicht aus Metall
en: Door knockers, not of metal

source: Schraubnieten, nicht aus Metall
en: Screw rivets, not of metal

source: Türschließer, nicht elektrisch und nicht aus Metall
en: Door closers (Non-electric -) of non-metallic materials

source: Dosen [Behälter nicht aus Metall]
en: Capsules [non-metallic containers]

source: Computerschränke [Möbel]
en: Computer cabinets [furniture]

source: Gardinenhalter aus Kunststoff zum Raffen von Gardinen
en: Curtain embraces of plastics for holding back curtains

source: Gardinenhaken aus Kunststoff
en: Curtain hooks made of plastics

source: Bernstein
en: Yellow amber

source: Schrankbeschläge, nicht aus Metall
en: Fittings (Non-metallic -) for cupboards

source: Schränke als Möbelstücke
en: Cupboards being furniture

source: Vorhangauf- und -zuzieher, nicht elektrisch
en: Curtain drawing devices, other than electrically operated

source: Möbel aus Metall und Campingmöbel
en: Metal furniture and furniture for camping

source: Verpackungsbehälter aus Kunststoff
en: Packaging containers of plastic

source: Bilderrahmen
en: Picture frames

source: Aufblasbare Möbel
en: Inflatable furniture

source: Nicht metallische Innenlamellejalousien
en: Non-metallic blinds [slatted] for internal use

source: Innenlamellenstores für Fenster
en: Slatted indoor blinds for windows

source: Nistkästen für Tiere
en: Nesting boxes for animals

source: Nicht metallische Polsterstifte
en: Non-metal upholstery tacks

source: Stapelboxen aus verpresstem Fasermaterial
en: Stacking boxes of compressed fibre

source: Stufenklemmen, nicht aus Metall
en: Stair clips (Non-metallic -)

source: Schnappschlösser, nicht aus Metall
en: Hasps of non-metallic materials

source: Kantenumrandungen aus Kunststoff für Regale
en: Plastic edging materials for shelving

source: Kunststoffeinsätze für Werkzeugkästen
en: Plastic inserts [trays] for tool boxes

source: Einsätze für Kleiderschränke [Teile von Möbeln]
en: Closet organisers [parts of furniture]

source: Schränke
en: Cupboards

source: Metallschränke [Möbel]
en: Metal cabinets [furniture]

source: Kunststoffstreifen zum Schutz von Möbelkanten
en: Strips of plastic for protecting the edges of furniture

source: Büsten aus Holz
en: Busts of wood

source: Schaugestelle für Waren
en: Display stands for merchandise

source: Schaugestelle für Poster
en: Display stands for posters

source: Möbel mit eingebauten Betten
en: Furniture incorporating beds

source: Handtuchhaken, nicht aus Metall
en: Hooks for towels (Non-metallic -)

source: Kissen [ausgenommen für medizinische Zwecke] zum Stützen von Kindern bei der Untersuchung
en: Cushions [other than for medical use] for supporting infants being examined

source: Türgriffe aus Porzellan
en: Door handles of porcelain

source: Einlegeböden für Aktenschränke
en: Shelves for file cabinets

source: Tische
en: Tables

source: Körbe, nicht aus Metall
en: Baskets, non-metallic

source: Schirmständer
en: Umbrella stands

source: Weinfässer, nicht aus Metall
en: Wine casks (Non-metallic -)

source: Federklappdübel, nicht aus Metall
en: Toggle bolts (Non-metallic -)

source: Schienen, nicht aus Metall
en: Tracks [rails] (Non-metallic -)

source: Wassereinläufe [Ventile aus Kunststoff] für Wasserrohre
en: Water inlets [valves of plastic] for water pipes

source: Wasserabflüsse [Ventile aus Kunststoff] für Wasserrohre
en: Water outlets [valves of plastic] for water pipes

source: Kästen aus laminiertem Kunststoff
en: Boxes made of laminated plastics

source: Kisten aus Kunststoffmaterialien für Verpackungszwecke
en: Boxes made of plastics materials for packaging

source: Lagertanks [Behälter] für Flüssigkeiten, nicht aus Metall
en: Liquid storage tanks [containers] made of non-metallic materials

source: Tragbare Ausstellungstafeln für Anzeigezwecke
en: Portable exhibition panelling for display purposes

source: Tragbare Aussteller für Waren [Möbel]
en: Portable sales display units [furniture]

source: Ständer für Poster
en: Poster display apparatus

source: Figuren aus Knochen
en: Statuettes of bone

source: Kannelierte Schienen, nicht aus Metall, zur Wandbefestigung von Flipcharts
en: Channelled strips (Non-metallic -) for securing flipcharts to walls

source: Kannelierte Schienen, nicht aus Metall, zur Wandbefestigung von Regalen
en: Channelled strips (Non-metallic -) for securing shelves to walls

source: Betten für Kinder
en: Children's beds

source: Kissen
en: Cushions

source: Luftmatratzen, nicht für medizinische Zwecke
en: Air mattresses, not for medical purposes

source: Regale zur Lagerung von Eis [Möbel]
en: Ice storage shelves [furniture]

source: Aufblasbare Kissen, ausgenommen für medizinische Zwecke
en: Inflatable cushions, other than for medical purposes

source: Aufblasbare Werbeballons
en: Inflatable publicity balloons

source: Versilbertes Glas [Spiegel]
en: Silvered glass [mirrors]

source: Vorrichtungen [nicht aus Metall, nicht elektrisch] zum Heben von Fenstern
en: Mechanisms (Non-metallic, non-electric -) for lifting windows

source: Möbel für die Aktenaufbewahrung
en: Furniture for filing purposes

source: Türbeschläge, nicht aus Metall
en: Door fittings, not of metal

source: Scharniere für Türen und Fenster, nicht aus Metall
en: Hinges for doors and windows (Non-metallic -)

source: Bilderrahmen aus Leder
en: Leather picture frames

source: Nägel, nicht aus Metall
en: Nails, not of metal

source: Holzgehäuse [Möbel] für elektronische Geräte
en: Wood surrounds [furniture] for electronic apparatus

source: Stapelbare Möbel
en: Stackable furniture

source: Nicht metallische Sägebänke, ausgenommen Maschinenteile
en: Saw benches [vice], not of metal, other than parts of machines

source: Wippstühle für Babys
en: Babies' bouncing chairs

source: Schienen für Deckenaufhängungen, nicht aus Metall
en: Overhead suspension tracks of non-metallic materials

source: Sicherheitskisten, nicht aus Metall
en: Security boxes, not of metal

source: Kabelkanäle aus nicht metallischem Material [nicht elektrisch]
en: Cable trunking of non-metallic materials [other than electric]

source: Bettrollen, nicht aus Metall
en: Bed casters, not of metal

source: Sargschilder, nicht aus Metall, für Bilder und Daten von Verstorbenen
en: Display head panels for caskets for displaying pictures and information about deceased

source: Vitrinen
en: Vitrines

source: Möbel für körperbehinderte Personen, Personen mit verminderter Beweglichkeit und Kranke
en: Furniture for the physically handicapped, those of reduced mobility and invalids

source: Schatullen aus Holz
en: Caskets made of wood

source: Türklinken, nicht aus Metall
en: Catches (Door -), not of metal

source: Möbelgriffe, nicht aus Metall
en: Catches (Furniture -), not of metal

source: Verbindungselemente [nicht aus Metall] für Möbel
en: Connecting elements (Non-metallic -) for furniture

source: Konsolen [Möbel]
en: Consoles [furniture]

source: Trennwände für Möbel
en: Furniture partitions

source: Kombinationsschlösser [nicht aus Metall, nicht elektrisch]
en: Combination locks (non-metallic -) [non-electric]

source: Feldbetten
en: Bed chairs

source: Nicht leuchtende Werbetafeln aus Kunststoff
en: Advertisement display boards of plastic [non-luminous]

source: Abstandshalter von Kunststoff für Verbundplatten
en: Spacers of plastic for use with sandwich panels

source: Schubladen als Teile von Ladenauslagemöbeln
en: Trays being parts of shop display furniture

source: Auslegeständer zum Ausstellen [nicht aus Metall]
en: Exhibition display stands [non-metallic]

source: Ausstellungsstände [nicht aus Metall, ausgenommen Bauten]
en: Exhibition stands [non-metallic, other than structures]

source: Hülsen für Spazierstöcke, nicht aus Metall
en: Ferrules of non-metallic materials for walking sticks

source: Weidenkörbe für Blumen
en: Flower baskets of wicker

source: Türstopper aus Kunststoff
en: Door stops of plastic

source: Freistehende Raumteiler für Büros
en: Free standing office partitions

source: Matratzen aus biegsamem Holz
en: Mattresses made of flexible wood

source: Zusammenfaltbare Verpackungskisten [aus Holz]
en: Boxes (packaging -) in flat form [wood]

source: Kästen für Lagerungszwecke aus Holz
en: Boxes for stacking purposes [wood]

source: Raumteiler [Möbel], nicht aus Metall, aus miteinander verbundenen Platten
en: Partitions (non metallic -), [furniture] made from interlocking panels

source: Stühle auf Sockeln
en: Pedestal chairs

source: Wandschirme [Möbel] für Büros
en: Wall screening [furniture] for offices

source: Wandregale [Gestelle] aus Metall
en: Wall shelves [structures] of metal

source: Milchfässer [nicht aus Metall]
en: Milk churns [non-metallic]

source: Erdöldrainagebehälter [nicht aus Metall]
en: Oil drainage containers [non-metallic]

source: Durchsichtige Möbeltüren, nicht aus Metall
en: Transparent doors (Non-metallic -) for furniture

source: Möbelrollen, nicht aus Metall
en: Furniture casters, not of metal

source: Länderkennzeichen, nicht aus Metall, für Fahrzeuge
en: Non-metallic nationality plates for vehicles

source: Stützgestelle [Möbel]
en: Support stands [furniture]

source: Tresen für Präsentationszwecke
en: Counters for display purposes

source: Anzeigetafeln [leere Anschlagtafeln]
en: Letter boards [blank display boards]

source: Behälter, nicht aus Metall, für Fassgetränke
en: Containers (Non-metallic -) for kegging beverages

source: Behälter, nicht aus Metall, in Form von Fässern
en: Containers (Non-metallic -) in the form of kegs

source: Transportbehälter aus Rohr
en: Containers made of cane

source: Türbeschläge aus Steingut
en: Door furniture made of stoneware

source: Wandhalterungen, nicht aus Metall [ausgenommen für Bauzwecke]
en: Cantilevered brackets of non-metallic materials [other than for building]

source: Schraubverschlüsse [nicht aus Metall] für Container
en: Cap closures (Non-metallic -) for containers

source: Verschlusskappen, nicht aus Metall, für Behälter
en: Caps made of non-metallic materials for containers

source: Behälterkappen aus Verbundwerkstoffen [nicht aus Metall und nicht für Haushalt und Küche]
en: Composite caps for containers [non-metallic and not for household or kitchen use]

source: Aufhängungen für Vorhänge
en: Curtain suspension devices

source: Verschlüsse aus Kunststoff für Glasbehälter
en: Closures made of plastic for containers made of glass

source: Bekleidungsständer [Möbel]
en: Clothes racks [furniture]

source: Tische aus Metall
en: Tables of metal

source: Auflageböcke [Möbel]
en: Trestles [furniture]

source: Werkzeugkisten, nicht aus Metall [leer]
en: Tool chests (non-metallic -) [empty]

source: Rahmen für Anschlagtafeln
en: Frames for display boards

source: Kabelbänder, nicht aus Metall
en: Non-metallic cable straps

source: Fässer, nicht aus Metall [ausgenommen für Haushalts- oder Küchenzwecke]
en: Non-metallic drums [other than for household or kitchen use]

source: Tubenverschlüsse, nicht aus Metall [ausgenommen für Haushalt oder Küche]
en: Non-metallic end closures for tubes [other than for household or kitchen use]

source: Stapelbare Kommodenfächer
en: Stacking dresser drawer units

source: Ventile aus Kunststoff [ausgenommen für medizinische Zwecke oder als Maschinenteile]
en: Plastic valves [other than for medical use or being parts of machines]

source: Behälterverschlüsse aus Plastik
en: Container closures of plastic

source: Kunststoffteile für Verpackungsbehälter
en: Plastics components for packaging containers

source: Schubladenschränke für Karten
en: Drawer storage for cards

source: Modellautos [Ziergegenstände] aus Holz
en: Miniature car models [ornaments] of wood

source: Transportable Rückenlehnen für Stühle
en: Portable back support for use with chairs

source: Büromöbel aus Metall
en: Metal office furniture

source: Möbel aus Metall als Regale
en: Racks being furniture of metal

source: Ablagen in Form von Möbeln, nicht aus Metall
en: Racks being furniture made of non-metallic materials

source: Regalrahmen, nicht aus Metall [Möbel]
en: Shelving frames, not of metal [furniture]

source: Schirme [Möbel] für Anzeigezwecke
en: Screens [furniture] for display purposes

source: Feuerbeständige Matratzen
en: Fire resistant mattresses

source: Möbelscharniere, nicht aus Metall
en: Furniture joints (Non-metallic -)

source: Schlösser für Möbel, nicht aus Metall
en: Furniture locks (Non-metallic -)

source: Möbelstützen, nicht aus Metall
en: Furniture supports (Non-metallic -)

source: Flache japanische Tische [Wazukue]
en: Japanese style low desks (wazukue)

source: Flache japanische Tische [Zataku]
en: Japanese style low tables (zataku)

source: Schwimmcontainer, nicht aus Metall
en: Floating containers, not of metal

source: Karren für Computer [Möbel]
en: Trolleys for computers [furniture]

source: Nieten, nicht aus Metall
en: Rivets, not of metal

source: Ventile [Hähne], nicht aus Metall, zum Steuern des Einlaufens von Flüssigkeiten in Fässer
en: Valves (Non-metallic -) [taps] for controlling the flow of liquid into barrels

source: Rohrbefestigungsmuffen [Kunststoff]
en: Pipe support sleeves [plastic]

source: Lautsprecherständer [Möbel]
en: Loudspeaker stands [furniture]

source: Vertikale Innenjalousien
en: Louvre blinds [indoor]

source: Tragbare Arbeitsflächen [Möbel]
en: Portable work surfaces [furniture]

source: Betten für Kinder aus Stoff in Form einer Tasche
en: Children's beds made of cloth in the form of a bag

source: Klemmen, nicht aus Metall
en: Clip clamps, not of metal

source: Gardinenhalter, nicht aus textilem Material
en: Curtain holders, not of textile material

source: Rohes oder teilweise bearbeitetes Perlmutt
en: Mother-of-pearl, unworked or semi-worked

source: Luftkissen, nicht für medizinische Zwecke
en: Air cushions, not for medical purposes

source: Torscharniere, nicht aus Metall
en: Gate eyes of non-metallic materials

source: Innenjalousien aus Stoff für Fenster
en: Interior textile window blinds

source: Miniaturfiguren [aus Kunststoff]
en: Miniature figurines [plastic]

source: Modellfiguren [Ziergegenstände] aus Kunstharz
en: Model figures [ornaments] made of synthetic resin

source: Tiermodelle [Ziergegenstände] aus Kunststoff
en: Model animals [ornaments] made of plastic

source: Tiermodelle [Ziergegenstände] aus Holz
en: Model animals [ornaments] made of wood

source: Hutregale [Möbel]
en: Hat racks [furniture]

source: Höhenverstellbare Küchenmöbel
en: Height adjustable kitchen furniture

source: Ladepaletten, nicht aus Metall
en: Loading pallets, not of metal

source: Kunststoffdeckel für Dosen
en: Plastic lids for cans

source: Holztruhen mit Schubladen, mit verziertem Papier überzogen
en: Wooden chests with drawers covered with decorated paper

source: Raumteiler aus Holzgittern
en: Wooden lattice work screens

source: Federn, überwiegend aus Kunststoff
en: Springs made principally of plastic

source: Schaugestelle aus Acryl
en: Acrylic counter displays

source: Spezialtische für Personen mit eingeschränkter Bewegungsfähigkeit
en: Tables adapted for use by those with mobility difficulties

source: Embleme, nicht aus Metall, für Fahrzeuge
en: Emblems, not of metal, for vehicles

source: Fensterrollen, nicht aus Metall
en: Sash pulleys, not of metal

source: Kabelkanäle [nicht aus Metall, nicht elektrisch]
en: Cable trays of non-metallic materials [other than electric]

source: Lüftungsgitter, nicht aus Metall, zum Einbau in Fenster
en: Ventilation grilles (Non-metallic -) for fitting in windows

source: Wandhaken, nicht aus Metall
en: Wall hooks of non-metallic materials

source: Gestelle [Möbel] für Lagerungszwecke, im Wesentlichen aus Holz
en: Racks [furniture] made principally of wood for storage purposes

source: Schaugestelle für den Verkauf von Waren
en: Display stands for selling goods

source: Kannelierte Schienen, nicht aus Metall, zur Wandbefestigung von Zeichenbrettern
en: Channelled strips (Non-metallic -) for securing drawing boards to walls

source: Konsolen [Möbel] zum Einbau von elektronischen Geräten
en: Consoles [furniture] for mounting units of electronic equipment

source: Sarggriffe, überwiegend aus Kunststoff
en: Coffin handles made principally of plastic

source: Korken für Behälter
en: Corks for containers

source: Kantenbeschläge, nicht aus Metall, für Behälter
en: Corner fittings (Non-metallic -) for containers

source: Gasflaschen, nicht aus Metall
en: Cylinders, not of metal for gas

source: Dekorative Kantenstreifen aus Kunststoff für Türbeschläge
en: Decorative edging strips of plastic for use with door fittings

source: Dekorative Kantenstreifen aus Holz für Einbaumöbel
en: Decorative edging strips of wood for use with fitted furniture

source: Schraubstifte, nicht aus Metall
en: Screw spikes, not of metal

source: Angepasste Möbelschutzhüllen
en: Seat covers [shaped] for furniture

source: Sitzmöbel für Kinder
en: Seats for children

source: Drehstühle
en: Swivel chairs

source: Umsetzbare Lagerregale [Möbel], nicht aus Metall
en: Relocatable non-metallic storage racks [furniture]

source: Statuetten aus Bernstein
en: Statuettes made of amber

source: Aufbewahrungskörbe [Möbel]
en: Storage baskets [furniture]

source: Diwane aus Weiden
en: Divans made of wicker

source: Diwane aus Holz
en: Divans made of wood

source: Nicht metallischer Espagnoletteverschluss
en: Espagnolette mechanisms, not of metal

source: Zusammenklappbare Tafeln für Anzeigezwecke
en: Folding panels for display purposes

source: Spinde für Kassierer, nicht aus Metall
en: Cashiers' lockers of non-metallic materials

source: Vierkant-Stellschrauben, nicht aus nicht Metall
en: Square set screws of non-metallic materials

source: Stützkopfkissen für Babys
en: Baby head support cushions

source: Stöpsel für Duschen, nicht aus Metall
en: Plugs for showers, not of metal

source: Mit Haar gefüllte Kissen
en: Cushions filled with hair

source: Trennwände aus Kunststoff [Möbel]
en: Partitions of plastics [furniture]

source: Tische auf Sockeln
en: Pedestal tables

source: Zusammensetzbare Elemente nicht aus Metall [Möbel]
en: Sectional non-metallic units [furniture]

source: Wandregale [Tragwerke] aus nicht metallischen Materialien
en: Wall shelves [structures] of non-metallic materials

source: Schrankwände [Möbel]
en: Wall units [furniture]

source: Sitze aus Metall
en: Seats of metal

source: Schmuckskulpturen aus Holz
en: Ornamental sculptures made of wood

source: Verpackungsbehälter aus Holz
en: Packaging containers made of wood

source: Rattan [unbearbeitet oder teilweise bearbeitet]
en: Rattan [unworked or partly worked material]

source: Schilfrohr [roh oder teilweise bearbeitet]
en: Reeds [raw or partly worked material]

source: Schaukelstühle
en: Rocking chairs

source: Drehknopfverschlüsse, nicht aus Metall
en: Turn-button fasteners (Non-metallic -)

source: Transportable Betten
en: Transportable beds

source: Mistkörbe [nicht aus Metall]
en: Manure baskets [non-metallic]

source: Rollos zur Verwendung in Innenräumen
en: Roller blinds for use indoors

source: Laufrollen [nicht aus Metall] für Schiebetüren
en: Rollers (Non-metallic -) for sliding doors

source: Kunstgegenstände aus Wachs
en: Works of art made of wax

source: Schienen für Schiebetüren, nicht aus Metall
en: Non-metallic tracks for sliding doors

source: Abstützteile für Schaugestelle
en: Supports for exhibition display material

source: Treppenbeschläge aus Kunststoff
en: Stair fittings of plastics

source: Armlehnen
en: Armrests

source: Montierte Ausstellungsständer
en: Assembled exhibition stands

source: Schutzbehälter, nicht aus Metall, zur Aufbewahrung von Waren
en: Protective containers of non-metallic materials for storing goods

source: Lagerungsbehälter [Möbel]
en: Storage units [furniture]

source: Behälter für Flüssigkeiten [nicht aus Metall, nicht für Haushalt und Küche]
en: Containers (non-metallic -) for liquids [other than for household or kitchen use]

source: Transportbehälter aus Horn
en: Containers made of horn

source: Schraubbolzen, nicht aus Metall
en: Screw bolts, not of metal

source: Türstopper, nicht aus Metall
en: Door buffers, not of metal

source: Kombinierte Deckel für Behälter [nicht aus Metall und nicht für Haushalt oder Küche]
en: Combined lids for containers [non-metallic and not for household or kitchen use]
